app/controllers/aquaponie_controller.rb

  def index
  	@aquaponie_mesures=AquaponieMesure.last
---
SELECT  `aquaponie_mesures`.* FROM `aquaponie_mesures`  ORDER BY `aquaponie_mesures`.`id` DESC LIMIT 1