app/controllers/home_controller.rb

SELECT  `aquaponie_mesures`.* FROM `aquaponie_mesures`  ORDER BY `aquaponie_mesures`.`id` DESC LIMIT 1
SELECT  `meteo_mesures`.* FROM `meteo_mesures`  ORDER BY `meteo_mesures`.`id` DESC LIMIT 1
---
  def index
  	@meteo_mesures=MeteoMesure.last #récupération de la dernière mesure entrée dans la BDD pour simuler le temps réel.
  									#Rappel : cette donnée est censée être mise à jour chaque minute.
  	@aquaponie_mesures=AquaponieMesure.last