app/views/aquaponie/annee.html.erb

<div class="row">
    <%= line_chart AquaponieMesure.group_by_month_of_year(:created_at).average(:pH), width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "pH" %>
---
SELECT AVG(`aquaponie_mesures`.`pH`) AS average_ph, MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS month_of_year FROM `aquaponie_mesures` WHERE (created_at >= '2016-07-17 13:37:26.752201' AND created_at <= '2016-07-18 13:37:26.752258') GROUP BY MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))

<div class="row">
  <%= line_chart AquaponieMesure.group_by_month_of_year(:created_at).average(:niveau), id: "Niveau", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Niveau (cm)", min: 0, max: 40 %>
---
SELECT AVG(`aquaponie_mesures`.`niveau`) AS average_niveau, MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS month_of_year FROM `aquaponie_mesures` WHERE (created_at >= '2016-07-17 13:37:26.755129' AND created_at <= '2016-07-18 13:37:26.755187') GROUP BY MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))