app/views/aquaponie/index.html.erb

SELECT  `aquaponie_mesures`.* FROM `aquaponie_mesures`  ORDER BY `aquaponie_mesures`.`id` DESC LIMIT 1
SELECT AVG(`aquaponie_mesures`.`pH`) AS average_ph, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `aquaponie_mesures` WHERE (created_at >= '2016-07-17 13:24:05.583014' AND created_at <= '2016-07-18 13:24:05.583095') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)
---
<div class="row">
    <%= line_chart AquaponieMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:pH), width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "pH" %>

SELECT AVG(`aquaponie_mesures`.`niveau`) AS average_niveau, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `aquaponie_mesures` WHERE (created_at >= '2016-07-17 13:25:04.882002' AND created_at <= '2016-07-18 13:25:04.882032') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)
---
<div class="row">
  <%= line_chart AquaponieMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:niveau), id: "Niveau", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Niveau (cm)", min: 0, max: 40 %>