app/views/aquaponie/jour.html.erb

<div class="row">
    <%= line_chart AquaponieMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:pH), width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "pH" %>
---
SELECT AVG(`aquaponie_mesures`.`pH`) AS average_ph, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `aquaponie_mesures` WHERE (created_at >= '2016-07-17 13:34:42.627171' AND created_at <= '2016-07-18 13:34:42.627219') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)

<div class="row">
  <%= line_chart AquaponieMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:niveau), id: "Niveau", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Niveau (cm)", min: 0, max: 40 %>
---
SELECT AVG(`aquaponie_mesures`.`niveau`) AS average_niveau, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `aquaponie_mesures` WHERE (created_at >= '2016-07-17 13:34:42.632276' AND created_at <= '2016-07-18 13:34:42.632324') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)