app/views/meteo/annee.html.erb

<div class="row">
    <%= line_chart MeteoMesure.group_by_month_of_year(:created_at).average(:temperature), width: "100%", height: "50%", xtitle: "Mois", ytitle: "Temp (°C)" %>
---
SELECT AVG(`meteo_mesures`.`temperature`) AS average_temperature, MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS month_of_year FROM `meteo_mesures` WHERE (created_at IS NOT NULL) GROUP BY MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))

<div class="row">
  <%= line_chart MeteoMesure.group_by_month_of_year(:created_at ).average(:pression), id: "Pression", width: "100%", height: "50%", xtitle: "Mois", ytitle: "Pres (hPa)", min: 980, max: 1030 %>
---
SELECT AVG(`meteo_mesures`.`pression`) AS average_pression, MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS month_of_year FROM `meteo_mesures` WHERE (created_at IS NOT NULL) GROUP BY MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))

<div class="row">
   <%= line_chart MeteoMesure.group_by_month_of_year(:created_at).average(:humidite), id: "Humidité", width: "100%", height: "50%", xtitle: "Mois", ytitle: "Humidité (%)", min: 0, max: 100 %>
---
SELECT AVG(`meteo_mesures`.`humidite`) AS average_humidite, MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS month_of_year FROM `meteo_mesures` WHERE (created_at IS NOT NULL) GROUP BY MONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))