app/views/meteo/index.html.erb

<div class="row">
    <%= line_chart MeteoMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:temperature), width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Temp (°C)" %>
---
SELECT  `meteo_mesures`.* FROM `meteo_mesures`  ORDER BY `meteo_mesures`.`id` DESC LIMIT 1
SELECT AVG(`meteo_mesures`.`temperature`) AS average_temperature, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `meteo_mesures` WHERE (created_at >= '2016-07-12 08:21:17.496097' AND created_at <= '2016-07-13 08:21:17.496202') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)

<div class="row">
  <%= line_chart MeteoMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:pression), id: "Pression", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Pres (hPa)", min: 980, max: 1030 %>
---
SELECT AVG(`meteo_mesures`.`pression`) AS average_pression, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `meteo_mesures` WHERE (created_at >= '2016-07-12 12:16:13.900328' AND created_at <= '2016-07-13 12:16:13.900371') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)

<div class="row">
   <%= line_chart MeteoMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:humidite), id: "Humidité", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Humidité (%)", min: 0, max: 100 %>
---
SELECT AVG(`meteo_mesures`.`humidite`) AS average_humidite, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `meteo_mesures` WHERE (created_at >= '2016-07-12 08:26:35.976702' AND created_at <= '2016-07-13 08:26:35.976745') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)