app/views/meteo/jour.html.erb

SELECT AVG(`meteo_mesures`.`temperature`) AS average_temperature, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `meteo_mesures` WHERE (created_at >= '2016-07-12 12:17:21.472077' AND created_at <= '2016-07-13 12:17:21.472116') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)
---
<div class="row">
    <%= line_chart MeteoMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:temperature), width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Temp (°C)" %>

SELECT AVG(`meteo_mesures`.`pression`) AS average_pression, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `meteo_mesures` WHERE (created_at >= '2016-07-12 12:17:21.476149' AND created_at <= '2016-07-13 12:17:21.476168') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)
---
<div class="row">
  <%= line_chart MeteoMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:pression), id: "Pression", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Pres (hPa)", min: 980, max: 1030 %>

SELECT AVG(`meteo_mesures`.`humidite`) AS average_humidite, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS hour FROM `meteo_mesures` WHERE (created_at >= '2016-07-12 12:17:21.482676' AND created_at <= '2016-07-13 12:17:21.482696') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d %H:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)
---
<div class="row">
   <%= line_chart MeteoMesure.group_by_hour(:created_at, range: 24.hours.ago..Time.now).average(:humidite), id: "Humidité", width: "100%", height: "50%", xtitle: "Temps (h)", ytitle: "Humidité (%)", min: 0, max: 100 %>