app/views/meteo/mois.html.erb

SELECT AVG(`meteo_mesures`.`temperature`) AS average_temperature, DAYOFMONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS day_of_month FROM `meteo_mesures` WHERE (created_at IS NOT NULL) GROUP BY DAYOFMONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))
---
<div class="row">
    <%= line_chart MeteoMesure.group_by_day_of_month(:created_at).average(:temperature), width: "100%", height: "50%", xtitle: "Jours", ytitle: "Temp (°C)" %>

SELECT AVG(`meteo_mesures`.`pression`) AS average_pression, DAYOFMONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS day_of_month FROM `meteo_mesures` WHERE (created_at IS NOT NULL) GROUP BY DAYOFMONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))
---
<div class="row">
  <%= line_chart MeteoMesure.group_by_day_of_month(:created_at ).average(:pression), id: "Pression", width: "100%", height: "50%", xtitle: "Jours", ytitle: "Pres (hPa)", min: 980, max: 1030 %>

SELECT AVG(`meteo_mesures`.`humidite`) AS average_humidite, DAYOFMONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC')) AS day_of_month FROM `meteo_mesures` WHERE (created_at IS NOT NULL) GROUP BY DAYOFMONTH(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'))
---
<div class="row">
   <%= line_chart MeteoMesure.group_by_day_of_month(:created_at).average(:humidite), id: "Humidité", width: "100%", height: "50%", xtitle: "Jours", ytitle: "Humidité (%)", min: 0, max: 100 %>